stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_lptim.h
/** @defgroup LPTIM_Clock_Prescaler LPTIM Clock Prescaler
  * @{
  */
#define LPTIM_PRESCALER_DIV1                    0x00000000U
#define LPTIM_PRESCALER_DIV2                    LPTIM_CFGR_PRESC_0
#define LPTIM_PRESCALER_DIV4                    LPTIM_CFGR_PRESC_1
#define LPTIM_PRESCALER_DIV8                    (LPTIM_CFGR_PRESC_0 | LPTIM_CFGR_PRESC_1)
#define LPTIM_PRESCALER_DIV16                   LPTIM_CFGR_PRESC_2
#define LPTIM_PRESCALER_DIV32                   (LPTIM_CFGR_PRESC_0 | LPTIM_CFGR_PRESC_2)
#define LPTIM_PRESCALER_DIV64                   (LPTIM_CFGR_PRESC_1 | LPTIM_CFGR_PRESC_2)
#define LPTIM_PRESCALER_DIV128                  LPTIM_CFGR_PRESC
/**
  * @}
  */

/** @defgroup LPTIM_Clock_Sample_Time LPTIM Clock Sample Time
  * @{
  */
#define LPTIM_CLOCKSAMPLETIME_DIRECTTRANSITION  0x00000000U
#define LPTIM_CLOCKSAMPLETIME_2TRANSITIONS      LPTIM_CFGR_CKFLT_0
#define LPTIM_CLOCKSAMPLETIME_4TRANSITIONS      LPTIM_CFGR_CKFLT_1
#define LPTIM_CLOCKSAMPLETIME_8TRANSITIONS      LPTIM_CFGR_CKFLT
/**
  * @}
  */

/** @defgroup LPTIM_Clock_Polarity LPTIM Clock Polarity
  * @{
  */
#define LPTIM_CLOCKPOLARITY_RISING              0x00000000U
#define LPTIM_CLOCKPOLARITY_FALLING             LPTIM_CFGR_CKPOL_0
#define LPTIM_CLOCKPOLARITY_RISING_FALLING      LPTIM_CFGR_CKPOL_1
/**
  * @}
  */

/** @defgroup LPTIM_Trigger_Source LPTIM Trigger Source
  * @{
  */
#define LPTIM_TRIGSOURCE_SOFTWARE               0x0000FFFFU
#define LPTIM_TRIGSOURCE_0                      0x00000000U
#define LPTIM_TRIGSOURCE_1                      LPTIM_CFGR_TRIGSEL_0
#define LPTIM_TRIGSOURCE_2                      LPTIM_CFGR_TRIGSEL_1
#define LPTIM_TRIGSOURCE_3                      (LPTIM_CFGR_TRIGSEL_0 | LPTIM_CFGR_TRIGSEL_1)
#define LPTIM_TRIGSOURCE_4                      LPTIM_CFGR_TRIGSEL_2
#define LPTIM_TRIGSOURCE_5                      (LPTIM_CFGR_TRIGSEL_0 | LPTIM_CFGR_TRIGSEL_2)
#define LPTIM_TRIGSOURCE_6                      (LPTIM_CFGR_TRIGSEL_1 | LPTIM_CFGR_TRIGSEL_2)
#define LPTIM_TRIGSOURCE_7                      LPTIM_CFGR_TRIGSEL
/**
  * @}
  */

/** @defgroup LPTIM_External_Trigger_Polarity LPTIM External Trigger Polarity
  * @{
  */
#define LPTIM_ACTIVEEDGE_RISING                LPTIM_CFGR_TRIGEN_0
#define LPTIM_ACTIVEEDGE_FALLING               LPTIM_CFGR_TRIGEN_1
#define LPTIM_ACTIVEEDGE_RISING_FALLING        LPTIM_CFGR_TRIGEN
/**
  * @}
  */

/** @defgroup LPTIM_Trigger_Sample_Time LPTIM Trigger Sample Time
  * @{
  */
#define LPTIM_TRIGSAMPLETIME_DIRECTTRANSITION  0x00000000U
#define LPTIM_TRIGSAMPLETIME_2TRANSITIONS      LPTIM_CFGR_TRGFLT_0
#define LPTIM_TRIGSAMPLETIME_4TRANSITIONS      LPTIM_CFGR_TRGFLT_1
#define LPTIM_TRIGSAMPLETIME_8TRANSITIONS      LPTIM_CFGR_TRGFLT
/**
  * @}
  */

/** @defgroup LPTIM_Updating_Mode LPTIM Updating Mode
  * @{
  */

#define LPTIM_UPDATE_IMMEDIATE                  0x00000000U
#define LPTIM_UPDATE_ENDOFPERIOD                LPTIM_CFGR_PRELOAD
/**
  * @}
  */

/** @defgroup LPTIM_Counter_Source LPTIM Counter Source
  * @{
  */

#define LPTIM_COUNTERSOURCE_INTERNAL            0x00000000U
#define LPTIM_COUNTERSOURCE_EXTERNAL            LPTIM_CFGR_COUNTMODE
/**
  * @}
  */

/** @defgroup LPTIM_Input1_Source LPTIM Input1 Source
  * @{
  */

#define LPTIM_INPUT1SOURCE_GPIO          0x00000000U                                      /*!< For LPTIM1, LPTIM2 and LPTIM3 */
#define LPTIM_INPUT1SOURCE_COMP1         LPTIM_CFGR2_IN1SEL_0                             /*!< For LPTIM1, LPTIM2 and LPTIM3 */
#if defined(COMP2)
#define LPTIM_INPUT1SOURCE_COMP2         LPTIM_CFGR2_IN1SEL_1                             /*!< For LPTIM2 */
#define LPTIM_INPUT1SOURCE_COMP1_COMP2   (LPTIM_CFGR2_IN1SEL_1 | LPTIM_CFGR2_IN1SEL_0)    /*!< For LPTIM2 */
#endif /* COMP2 */
/**
  * @}
  */

/** @defgroup LPTIM_Input2_Source LPTIM Input2 Source
  * @{
  */

#define LPTIM_INPUT2SOURCE_GPIO          0x00000000U                                      /*!< For LPTIM1 and LPTIM3 */
#if defined(COMP2)
#define LPTIM_INPUT2SOURCE_COMP2         LPTIM_CFGR2_IN2SEL_0                             /*!< For LPTIM1 and LPTIM3 */
#endif /* COMP2 */
/**
  * @}
  */

/** @defgroup LPTIM_Flag_Definition LPTIM Flags Definition
  * @{
  */

#define LPTIM_FLAG_CC1O                          LPTIM_ISR_CC1OF
#define LPTIM_FLAG_CC2O                          LPTIM_ISR_CC2OF
#define LPTIM_FLAG_CC3O                          LPTIM_ISR_CC3OF
#define LPTIM_FLAG_CC4O                          LPTIM_ISR_CC4OF
#define LPTIM_FLAG_CC1                           LPTIM_ISR_CC1IF
#define LPTIM_FLAG_CC2                           LPTIM_ISR_CC2IF
#define LPTIM_FLAG_CC3                           LPTIM_ISR_CC3IF
#define LPTIM_FLAG_CC4                           LPTIM_ISR_CC4IF
#define LPTIM_FLAG_CMP1OK                        LPTIM_ISR_CMP1OK
#define LPTIM_FLAG_CMP2OK                        LPTIM_ISR_CMP2OK
#define LPTIM_FLAG_CMP3OK                        LPTIM_ISR_CMP3OK
#define LPTIM_FLAG_CMP4OK                        LPTIM_ISR_CMP4OK
#define LPTIM_FLAG_DIEROK                        LPTIM_ISR_DIEROK
#define LPTIM_FLAG_REPOK                         LPTIM_ISR_REPOK
#define LPTIM_FLAG_UPDATE                        LPTIM_ISR_UE
#define LPTIM_FLAG_DOWN                          LPTIM_ISR_DOWN
#define LPTIM_FLAG_UP                            LPTIM_ISR_UP
#define LPTIM_FLAG_ARROK                         LPTIM_ISR_ARROK
#define LPTIM_FLAG_EXTTRIG                       LPTIM_ISR_EXTTRIG
#define LPTIM_FLAG_ARRM                          LPTIM_ISR_ARRM
/**
  * @}
  */

/** @defgroup LPTIM_DMA_sources LPTIM DMA Sources
  * @{
  */
#define LPTIM_DMA_UPDATE                     LPTIM_DIER_UEDE         /*!< DMA request is triggered by the update event */
#define LPTIM_DMA_CC1                        LPTIM_DIER_CC1DE        /*!< DMA request is triggered by the capture 1 event */
#define LPTIM_DMA_CC2                        LPTIM_DIER_CC2DE        /*!< DMA request is triggered by the capture 2 event */
#define LPTIM_DMA_CC3                        LPTIM_DIER_CC3DE        /*!< DMA request is triggered by the capture 3 event */
#define LPTIM_DMA_CC4                        LPTIM_DIER_CC4DE        /*!< DMA request is triggered by the capture 4 event */

/**
  * @}
  */

/** @defgroup LPTIM_DMA_Handle_index LPTIM DMA Handle Index
  * @{
  */
#define LPTIM_DMA_ID_UPDATE                ((uint16_t) 0x0000)       /*!< Index of the DMA handle used for Update DMA requests */
#define LPTIM_DMA_ID_CC1                   ((uint16_t) 0x0001)       /*!< Index of the DMA handle used for Capture/Update event 1 DMA request */
#define LPTIM_DMA_ID_CC2                   ((uint16_t) 0x0002)       /*!< Index of the DMA handle used for Capture/Update event 2 DMA request */
#define LPTIM_DMA_ID_CC3                   ((uint16_t) 0x0003)       /*!< Index of the DMA handle used for Capture/Update event 3 DMA request */
#define LPTIM_DMA_ID_CC4                   ((uint16_t) 0x0004)       /*!< Index of the DMA handle used for Capture/Update event 4 DMA request */
/**
  * @}
  */

/** @defgroup LPTIM_Interrupts_Definition LPTIM Interrupts Definition
  * @{
  */
#define LPTIM_IT_CC1O                            LPTIM_DIER_CC1OIE
#define LPTIM_IT_CC2O                            LPTIM_DIER_CC2OIE
#define LPTIM_IT_CC3O                            LPTIM_DIER_CC3OIE
#define LPTIM_IT_CC4O                            LPTIM_DIER_CC4OIE
#define LPTIM_IT_CC1                             LPTIM_DIER_CC1IE
#define LPTIM_IT_CC2                             LPTIM_DIER_CC2IE
#define LPTIM_IT_CC3                             LPTIM_DIER_CC3IE
#define LPTIM_IT_CC4                             LPTIM_DIER_CC4IE
#define LPTIM_IT_CMP1OK                          LPTIM_DIER_CMP1OKIE
#define LPTIM_IT_CMP2OK                          LPTIM_DIER_CMP2OKIE
#define LPTIM_IT_CMP3OK                          LPTIM_DIER_CMP3OKIE
#define LPTIM_IT_CMP4OK                          LPTIM_DIER_CMP4OKIE
#define LPTIM_IT_REPOK                           LPTIM_DIER_REPOKIE
#define LPTIM_IT_UPDATE                          LPTIM_DIER_UEIE
#define LPTIM_IT_DOWN                            LPTIM_DIER_DOWNIE
#define LPTIM_IT_UP                              LPTIM_DIER_UPIE
#define LPTIM_IT_ARROK                           LPTIM_DIER_ARROKIE
#define LPTIM_IT_EXTTRIG                         LPTIM_DIER_EXTTRIGIE
#define LPTIM_IT_ARRM                            LPTIM_DIER_ARRMIE
/**
  * @}
  */

/** @defgroup LPTIM_Channel LPTIM Channel
  * @{
  */
#define LPTIM_CHANNEL_1                      LL_LPTIM_CHANNEL_CH1                          /*!< Capture/compare channel 1 identifier      */
#define LPTIM_CHANNEL_2                      LL_LPTIM_CHANNEL_CH2                          /*!< Capture/compare channel 2 identifier      */
#define LPTIM_CHANNEL_3                      LL_LPTIM_CHANNEL_CH3                          /*!< Capture/compare channel 1 identifier      */
#define LPTIM_CHANNEL_4                      LL_LPTIM_CHANNEL_CH4                          /*!< Capture/compare channel 2 identifier      */
/**
  * @}
  */

