stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_lptim.h
/** @defgroup LPTIM_Output_Compare_Polarity LPTIM Output Compare Polarity
  * @{
  */
#define LPTIM_OCPOLARITY_HIGH                    0x00000000U                    /*!< Capture/Compare output polarity */
#define LPTIM_OCPOLARITY_LOW                     0x00000001U                    /*!< Capture/Compare output polarity */
/**
  * @}
  */

/** @defgroup LPTIM_Input_Capture_Prescaler LPTIM Input Capture Prescaler
  * @{
  */
#define LPTIM_ICPSC_DIV1                          0x00000000UL                                  /*!< Capture performed each time an edge is detected on the capture input */
#define LPTIM_ICPSC_DIV2                          LPTIM_CCMR1_IC1PSC_0                          /*!< Capture performed once every 2 events                                */
#define LPTIM_ICPSC_DIV4                          LPTIM_CCMR1_IC1PSC_1                          /*!< Capture performed once every 4 events                                */
#define LPTIM_ICPSC_DIV8                         (LPTIM_CCMR1_IC1PSC_0|LPTIM_CCMR1_IC1PSC_1)    /*!< Capture performed once every 8 events                                */
/**
  * @}
  */

/** @defgroup LPTIM_Input_Capture_Polarity LPTIM Input Capture Polarity
  * @{
  */
#define LPTIM_ICPOLARITY_RISING                    0x00000000UL                              /*!< Capture/Compare input rising polarity */
#define LPTIM_ICPOLARITY_FALLING                   LPTIM_CCMR1_CC1P_0                        /*!< Capture/Compare input falling polarity */
#define LPTIM_ICPOLARITY_RISING_FALLING           (LPTIM_CCMR1_CC1P_0|LPTIM_CCMR1_CC1P_1)    /*!< Capture/Compare input rising and falling polarities */
/**
  * @}
  */

/** @defgroup LPTIM_Input_Capture_Filter LPTIM Input Capture Filter
  * @{
  */
#define LPTIM_ICFLT_CLOCK_DIV1                     0x00000000UL                            /*!< any external input capture signal level change is considered as a valid transition */
#define LPTIM_ICFLT_CLOCK_DIV2                     LPTIM_CCMR1_IC1F_0                      /*!< external input capture signal level change must be stable for at least 2 clock periods before it is considered as valid transition */
#define LPTIM_ICFLT_CLOCK_DIV4                     LPTIM_CCMR1_IC1F_1                      /*!< external input capture signal level change must be stable for at least 4 clock periods before it is considered as valid transition */
#define LPTIM_ICFLT_CLOCK_DIV8                    (LPTIM_CCMR1_IC1F_0|LPTIM_CCMR1_IC1F_1)  /*!< external input capture signal level change must be stable for at least 8 clock periods before it is considered as valid transition */
/**
  * @}
  */

/** @defgroup LPTIM_Input_Capture_Source LPTIM Input Capture Source
  * @{
  */
#define LPTIM_IC1SOURCE_GPIO                       0x00000000UL                                  /*!< For LPTIM1, LPTIM2 and LPTIM3 */
#define LPTIM_IC1SOURCE_COMP1                      LPTIM_CFGR2_IC1SEL_0                          /*!< For LPTIM1, LPTIM2 and LPTIM3 */
#if defined(COMP2)
#define LPTIM_IC1SOURCE_COMP2                      LPTIM_CFGR2_IC1SEL_1                          /*!< For LPTIM1, LPTIM2 and LPTIM3 */
#endif /* COMP2 */
#define LPTIM_IC2SOURCE_GPIO                       0x00000000UL                                  /*!< For LPTIM1, LPTIM2 and LPTIM3 */
#define LPTIM_IC2SOURCE_MCO1                       LPTIM_CFGR2_IC2SEL_0                          /*!< For LPTIM1, LPTIM2 and LPTIM3 */
#define LPTIM_IC2SOURCE_MCO2                       LPTIM_CFGR2_IC2SEL_1                          /*!< For LPTIM1, LPTIM2 and LPTIM3 */
#define LPTIM_IC3SOURCE_GPIO                       0x00000000UL                                  /*!< For LPTIM1 and LPTIM3 */
#define LPTIM_IC3SOURCE_COMP1                      LPTIM_CFGR2_IC3SEL_0                          /*!< For LPTIM1 and LPTIM3 */
#if defined(COMP2)
#define LPTIM_IC3SOURCE_COMP2                      LPTIM_CFGR2_IC3SEL_1                          /*!< For LPTIM1 and LPTIM3 */
#endif /* COMP2 */
#define LPTIM_IC4SOURCE_GPIO                       0x00000000UL                                  /*!< For LPTIM1 and LPTIM3 */
#define LPTIM_IC4SOURCE_COMP1                      LPTIM_CFGR2_IC4SEL_0                          /*!< For LPTIM1 and LPTIM3 */
#if defined(COMP2)
#define LPTIM_IC4SOURCE_COMP2                      LPTIM_CFGR2_IC4SEL_1                          /*!< For LPTIM1 and LPTIM3 */
#endif /* COMP2 */
/**
  * @}
  */
/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup LPTIM_Exported_Macros LPTIM Exported Macros
  * @{
  */

/** @brief Reset LPTIM handle state.
  * @param  __HANDLE__ LPTIM handle
  * @retval None
  */
#if (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
#define __HAL_LPTIM_RESET_HANDLE_STATE(__HANDLE__) do {                                                        \
                                                        (__HANDLE__)->State             = HAL_LPTIM_STATE_RESET; \
                                                        (__HANDLE__)->ChannelState[0]  = HAL_LPTIM_CHANNEL_STATE_RESET;\
                                                        (__HANDLE__)->ChannelState[1]  = HAL_LPTIM_CHANNEL_STATE_RESET;\
                                                        (__HANDLE__)->ChannelState[2]  = HAL_LPTIM_CHANNEL_STATE_RESET;\
                                                        (__HANDLE__)->ChannelState[3]  = HAL_LPTIM_CHANNEL_STATE_RESET;\
                                                        (__HANDLE__)->MspInitCallback   = NULL;                  \
                                                        (__HANDLE__)->MspDeInitCallback = NULL;                  \
                                                      } while(0)
#else
#define __HAL_LPTIM_RESET_HANDLE_STATE(__HANDLE__) do {                                                              \
                                                        (__HANDLE__)->State            = HAL_LPTIM_STATE_RESET;        \
                                                        (__HANDLE__)->ChannelState[0]  = HAL_LPTIM_CHANNEL_STATE_RESET;\
                                                        (__HANDLE__)->ChannelState[1]  = HAL_LPTIM_CHANNEL_STATE_RESET;\
                                                        (__HANDLE__)->ChannelState[2]  = HAL_LPTIM_CHANNEL_STATE_RESET;\
                                                        (__HANDLE__)->ChannelState[3]  = HAL_LPTIM_CHANNEL_STATE_RESET;\
                                                      } while(0)
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */

/**
  * @brief  Enable the LPTIM peripheral.
  * @param  __HANDLE__ LPTIM handle
  * @retval None
  */
#define __HAL_LPTIM_ENABLE(__HANDLE__)   ((__HANDLE__)->Instance->CR |= (LPTIM_CR_ENABLE))

/**
  * @brief  Disable the LPTIM peripheral.
  * @param  __HANDLE__ LPTIM handle
  * @retval None
  */
#define __HAL_LPTIM_DISABLE(__HANDLE__)                                        \
  do {                                                                         \
    if (IS_LPTIM_CC4_INSTANCE((__HANDLE__)->Instance) == 1UL)                  \
    {                                                                          \
      if (((__HANDLE__)->Instance->CCMR1 & LPTIM_CCMR1_CC1E) == 0UL)           \
      {                                                                        \
        if (((__HANDLE__)->Instance->CCMR1 & LPTIM_CCMR1_CC2E) == 0UL)         \
        {                                                                      \
          if (((__HANDLE__)->Instance->CCMR2 & LPTIM_CCMR2_CC3E) == 0UL)       \
          {                                                                    \
            if (((__HANDLE__)->Instance->CCMR2 & LPTIM_CCMR2_CC4E) == 0UL)     \
            {                                                                  \
              CLEAR_BIT((__HANDLE__)->Instance->CR, LPTIM_CR_ENABLE);          \
            }                                                                  \
          }                                                                    \
        }                                                                      \
      }                                                                        \
    }                                                                          \
    else if (IS_LPTIM_CC2_INSTANCE((__HANDLE__)->Instance) == 1UL)             \
    {                                                                          \
      if (((__HANDLE__)->Instance->CCMR1 & LPTIM_CCMR1_CC1E) == 0UL)           \
      {                                                                        \
        if (((__HANDLE__)->Instance->CCMR1 & LPTIM_CCMR1_CC2E) == 0UL)         \
        {                                                                      \
          CLEAR_BIT((__HANDLE__)->Instance->CR, LPTIM_CR_ENABLE);              \
        }                                                                      \
      }                                                                        \
    }                                                                          \
    else                                                                       \
    {                                                                          \
      CLEAR_BIT((__HANDLE__)->Instance->CR, LPTIM_CR_ENABLE);                  \
    }                                                                          \
  } while(0)

/**
  * @brief  Start the LPTIM peripheral in Continuous mode.
  * @param  __HANDLE__ LPTIM handle
  * @retval None
  */
#define __HAL_LPTIM_START_CONTINUOUS(__HANDLE__)  ((__HANDLE__)->Instance->CR |=  LPTIM_CR_CNTSTRT)
/**
  * @brief  Start the LPTIM peripheral in single mode.
  * @param  __HANDLE__ LPTIM handle
  * @retval None
  */
#define __HAL_LPTIM_START_SINGLE(__HANDLE__)      ((__HANDLE__)->Instance->CR |=  LPTIM_CR_SNGSTRT)

/**
  * @brief  Reset the LPTIM Counter register in synchronous mode.
  * @param  __HANDLE__ LPTIM handle
  * @retval None
  */
#define __HAL_LPTIM_RESET_COUNTER(__HANDLE__)      ((__HANDLE__)->Instance->CR |=  LPTIM_CR_COUNTRST)

/**
  * @brief  Reset after read of the LPTIM Counter register in asynchronous mode.
  * @param  __HANDLE__ LPTIM handle
  * @retval None
  */
#define __HAL_LPTIM_RESET_COUNTER_AFTERREAD(__HANDLE__)      ((__HANDLE__)->Instance->CR |=  LPTIM_CR_RSTARE)

/**
  * @brief  Write the passed parameter in the Autoreload register.
  * @param  __HANDLE__ LPTIM handle
  * @param  __VALUE__ Autoreload value
  * @retval None
  * @note   The ARR register can only be modified when the LPTIM instance is enabled.
  */
#define __HAL_LPTIM_AUTORELOAD_SET(__HANDLE__ , __VALUE__)  ((__HANDLE__)->Instance->ARR =  (__VALUE__))

/**
  * @brief  Write the passed parameter in the Compare register.
  * @param  __HANDLE__ LPTIM handle
  * @param  __VALUE__ Compare value
  * @param  __CHANNEL__ TIM Channel to be configured
  * @retval None
  * @note   The CCRx registers can only be modified when the LPTIM instance is enabled.
  */
#define __HAL_LPTIM_COMPARE_SET(__HANDLE__ , __CHANNEL__, __VALUE__) \
  (((__CHANNEL__) == LPTIM_CHANNEL_1) ? ((__HANDLE__)->Instance->CCR1 = (__VALUE__)) :\
   ((__CHANNEL__) == LPTIM_CHANNEL_2) ? ((__HANDLE__)->Instance->CCR2 = (__VALUE__)) :\
   ((__CHANNEL__) == LPTIM_CHANNEL_3) ? ((__HANDLE__)->Instance->CCR3 = (__VALUE__)) :\
   ((__CHANNEL__) == LPTIM_CHANNEL_4) ? ((__HANDLE__)->Instance->CCR4 = (__VALUE__)) : 0U)

/**
  * @brief  Write the passed parameter in the Repetition register.
  * @param  __HANDLE__ LPTIM handle
  * @param  __VALUE__ Repetition value
  * @retval None
  */
#define __HAL_LPTIM_REPETITIONCOUNTER_SET(__HANDLE__ , __VALUE__)  ((__HANDLE__)->Instance->RCR =  (__VALUE__))

/**
  * @brief  Return the current Repetition value.
  * @param  __HANDLE__ LPTIM handle
  * @retval Repetition register value
  * @note   The RCR register can only be modified when the LPTIM instance is enabled.
  */
#define __HAL_LPTIM_REPETITIONCOUNTER_GET(__HANDLE__)  ((__HANDLE__)->Instance->RCR)

/**
  * @brief  Enable the LPTIM signal input/output on the corresponding pin.
  * @param  __HANDLE__  LPTIM handle
  * @param  __CHANNEL__ LPTIM Channels to be enabled.
  *          This parameter can be one of the following values:
  *            @arg LPTIM_CHANNEL_1: LPTIM Channel 1 selected
  *            @arg LPTIM_CHANNEL_2: LPTIM Channel 2 selected
  *            @arg LPTIM_CHANNEL_3: LPTIM Channel 3 selected
  *            @arg LPTIM_CHANNEL_4: LPTIM Channel 4 selected
  * @retval None
  */
#define __HAL_LPTIM_CAPTURE_COMPARE_ENABLE(__HANDLE__, __CHANNEL__) \
  do {                                                              \
    switch (__CHANNEL__)                                            \
    {                                                               \
      case LPTIM_CHANNEL_1:                                         \
        ((__HANDLE__)->Instance->CCMR1 |= LPTIM_CCMR1_CC1E);        \
        break;                                                      \
      case LPTIM_CHANNEL_2:                                         \
        ((__HANDLE__)->Instance->CCMR1 |= LPTIM_CCMR1_CC2E);        \
        break;                                                      \
      case LPTIM_CHANNEL_3:                                         \
        ((__HANDLE__)->Instance->CCMR2 |= LPTIM_CCMR2_CC3E);        \
        break;                                                      \
      case LPTIM_CHANNEL_4:                                         \
        ((__HANDLE__)->Instance->CCMR2 |= LPTIM_CCMR2_CC4E);        \
        break;                                                      \
      default:                                                      \
        break;                                                      \
    }                                                               \
  }                                                                 \
  while(0)

/**
  * @brief  Disable the LPTIM signal input/output on the corresponding pin.
  * @param  __HANDLE__  LPTIM handle
  * @param  __CHANNEL__ LPTIM Channels to be disabled.
  *          This parameter can be one of the following values:
  *            @arg LPTIM_CHANNEL_1: LPTIM Channel 1 selected
  *            @arg LPTIM_CHANNEL_2: LPTIM Channel 2 selected
  *            @arg LPTIM_CHANNEL_3: LPTIM Channel 3 selected
  *            @arg LPTIM_CHANNEL_4: LPTIM Channel 4 selected
  * @retval None
  */
#define __HAL_LPTIM_CAPTURE_COMPARE_DISABLE(__HANDLE__, __CHANNEL__) \
  do {                                                               \
    switch (__CHANNEL__)                                             \
    {                                                                \
      case LPTIM_CHANNEL_1:                                          \
        ((__HANDLE__)->Instance->CCMR1 &= ~LPTIM_CCMR1_CC1E);        \
        break;                                                       \
      case LPTIM_CHANNEL_2:                                          \
        ((__HANDLE__)->Instance->CCMR1 &= ~LPTIM_CCMR1_CC2E);        \
        break;                                                       \
      case LPTIM_CHANNEL_3:                                          \
        ((__HANDLE__)->Instance->CCMR2 &= ~LPTIM_CCMR2_CC3E);        \
        break;                                                       \
      case LPTIM_CHANNEL_4:                                          \
        ((__HANDLE__)->Instance->CCMR2 &= ~LPTIM_CCMR2_CC4E);        \
        break;                                                       \
      default:                                                       \
        break;                                                       \
    }                                                                \
  }                                                                  \
  while(0)

/**
  * @brief  Check whether the specified LPTIM flag is set or not.
  * @param  __HANDLE__ LPTIM handle
  * @param  __FLAG__ LPTIM flag to check
  *            This parameter can be a value of:
  *            @arg LPTIM_FLAG_REPOK   : Repetition register update OK Flag.
  *            @arg LPTIM_FLAG_UPDATE  : Update event Flag.
  *            @arg LPTIM_FLAG_DOWN    : Counter direction change up Flag.
  *            @arg LPTIM_FLAG_UP      : Counter direction change down to up Flag.
  *            @arg LPTIM_FLAG_ARROK   : Autoreload register update OK Flag.
  *            @arg LPTIM_FLAG_CMP1OK  : Compare register 1 update OK Flag.
  *            @arg LPTIM_FLAG_CMP2OK  : Compare register 2 update OK Flag.
  *            @arg LPTIM_FLAG_CMP3OK  : Compare register 3 update OK Flag.
  *            @arg LPTIM_FLAG_CMP4OK  : Compare register 4 update OK Flag.
  *            @arg LPTIM_FLAG_EXTTRIG : External trigger edge event Flag.
  *            @arg LPTIM_FLAG_ARRM    : Autoreload match Flag.
  *            @arg LPTIM_FLAG_CC1     : Capture/Compare 1 interrupt flag.
  *            @arg LPTIM_FLAG_CC2     : Capture/Compare 2 interrupt flag.
  *            @arg LPTIM_FLAG_CC3     : Capture/Compare 3 interrupt flag.
  *            @arg LPTIM_FLAG_CC4     : Capture/Compare 4 interrupt flag.
  *            @arg LPTIM_FLAG_CC1O    : Capture/Compare 1 over-capture flag.
  *            @arg LPTIM_FLAG_CC2O    : Capture/Compare 2 over-capture flag.
  *            @arg LPTIM_FLAG_CC3O    : Capture/Compare 3 over-capture flag.
  *            @arg LPTIM_FLAG_CC4O    : Capture/Compare 4 over-capture flag.
  *            @arg LPTIM_FLAG_DIEROK  : DMA & interrupt enable update OK flag.
  * @retval The state of the specified flag (SET or RESET).
  */
#define __HAL_LPTIM_GET_FLAG(__HANDLE__, __FLAG__)          (((__HANDLE__)->Instance->ISR &(__FLAG__)) == (__FLAG__))

/**
  * @brief  Clear the specified LPTIM flag.
  * @param  __HANDLE__ LPTIM handle.
  * @param  __FLAG__ LPTIM flag to clear.
  *            This parameter can be a value of:
  *            @arg LPTIM_FLAG_REPOK   : Repetition register update OK Flag.
  *            @arg LPTIM_FLAG_UPDATE  : Update event Flag.
  *            @arg LPTIM_FLAG_DOWN    : Counter direction change up Flag.
  *            @arg LPTIM_FLAG_UP      : Counter direction change down to up Flag.
  *            @arg LPTIM_FLAG_ARROK   : Autoreload register update OK Flag.
  *            @arg LPTIM_FLAG_CMP1OK  : Compare register 1 update OK Flag.
  *            @arg LPTIM_FLAG_CMP2OK  : Compare register 2 update OK Flag.
  *            @arg LPTIM_FLAG_CMP3OK  : Compare register 3 update OK Flag.
  *            @arg LPTIM_FLAG_CMP4OK  : Compare register 4 update OK Flag.
  *            @arg LPTIM_FLAG_EXTTRIG : External trigger edge event Flag.
  *            @arg LPTIM_FLAG_ARRM    : Autoreload match Flag.
  *            @arg LPTIM_FLAG_CC1     : Capture/Compare 1 interrupt flag.
  *            @arg LPTIM_FLAG_CC2     : Capture/Compare 2 interrupt flag.
  *            @arg LPTIM_FLAG_CC3     : Capture/Compare 3 interrupt flag.
  *            @arg LPTIM_FLAG_CC4     : Capture/Compare 4 interrupt flag.
  *            @arg LPTIM_FLAG_CC1O    : Capture/Compare 1 over-capture flag.
  *            @arg LPTIM_FLAG_CC2O    : Capture/Compare 2 over-capture flag.
  *            @arg LPTIM_FLAG_CC3O    : Capture/Compare 3 over-capture flag.
  *            @arg LPTIM_FLAG_CC4O    : Capture/Compare 4 over-capture flag.
  *            @arg LPTIM_FLAG_DIEROK  : DMA & interrupt enable update OK flag.
  * @retval None.
  */
#define __HAL_LPTIM_CLEAR_FLAG(__HANDLE__, __FLAG__)        ((__HANDLE__)->Instance->ICR  = (__FLAG__))

/**
  * @brief  Enable the specified LPTIM interrupt.
  * @param  __HANDLE__ LPTIM handle.
  * @param  __INTERRUPT__ LPTIM interrupt to set.
  *            This parameter can be a value of:
  *            @arg LPTIM_IT_REPOK   : Repetition register update OK Interrupt.
  *            @arg LPTIM_IT_UPDATE  : Update event register Interrupt.
  *            @arg LPTIM_IT_DOWN    : Counter direction change up Interrupt.
  *            @arg LPTIM_IT_UP      : Counter direction change down to up Interrupt.
  *            @arg LPTIM_IT_ARROK   : Autoreload register update OK Interrupt.
  *            @arg LPTIM_IT_CMP1OK  : Compare register 1 update OK Interrupt.
  *            @arg LPTIM_IT_CMP2OK  : Compare register 2 update OK Interrupt.
  *            @arg LPTIM_IT_CMP3OK  : Compare register 3 update OK Interrupt.
  *            @arg LPTIM_IT_CMP4OK  : Compare register 4 update OK Interrupt.
  *            @arg LPTIM_IT_EXTTRIG : External trigger edge event Interrupt.
  *            @arg LPTIM_IT_ARRM    : Autoreload match Interrupt.
  *            @arg LPTIM_IT_CC1     : Capture/Compare 1 interrupt Interrupt.
  *            @arg LPTIM_IT_CC2     : Capture/Compare 2 interrupt Interrupt.
  *            @arg LPTIM_IT_CC3     : Capture/Compare 3 interrupt Interrupt.
  *            @arg LPTIM_IT_CC4     : Capture/Compare 4 interrupt Interrupt.
  *            @arg LPTIM_IT_CC1O    : Capture/Compare 1 over-capture Interrupt.
  *            @arg LPTIM_IT_CC2O    : Capture/Compare 2 over-capture Interrupt.
  *            @arg LPTIM_IT_CC3O    : Capture/Compare 3 over-capture Interrupt.
  *            @arg LPTIM_IT_CC4O    : Capture/Compare 4 over-capture Interrupt.
  * @retval None.
  * @note   The LPTIM interrupts can only be enabled when the LPTIM instance is enabled.
  */
#define __HAL_LPTIM_ENABLE_IT(__HANDLE__, __INTERRUPT__)    ((__HANDLE__)->Instance->DIER  |= (__INTERRUPT__))

/**
  * @brief  Disable the specified LPTIM interrupt.
  * @param  __HANDLE__ LPTIM handle.
  * @param  __INTERRUPT__ LPTIM interrupt to set.
  *            This parameter can be a value of:
  *            @arg LPTIM_IT_REPOK   : Repetition register update OK Interrupt.
  *            @arg LPTIM_IT_UPDATE  : Update event register Interrupt.
  *            @arg LPTIM_IT_DOWN    : Counter direction change up Interrupt.
  *            @arg LPTIM_IT_UP      : Counter direction change down to up Interrupt.
  *            @arg LPTIM_IT_ARROK   : Autoreload register update OK Interrupt.
  *            @arg LPTIM_IT_CMP1OK  : Compare register 1 update OK Interrupt.
  *            @arg LPTIM_IT_CMP2OK  : Compare register 2 update OK Interrupt.
  *            @arg LPTIM_IT_CMP3OK  : Compare register 3 update OK Interrupt.
  *            @arg LPTIM_IT_CMP4OK  : Compare register 4 update OK Interrupt.
  *            @arg LPTIM_IT_EXTTRIG : External trigger edge event Interrupt.
  *            @arg LPTIM_IT_ARRM    : Autoreload match Interrupt.
  *            @arg LPTIM_IT_CC1     : Capture/Compare 1 interrupt Interrupt.
  *            @arg LPTIM_IT_CC2     : Capture/Compare 2 interrupt Interrupt.
  *            @arg LPTIM_IT_CC3     : Capture/Compare 3 interrupt Interrupt.
  *            @arg LPTIM_IT_CC4     : Capture/Compare 4 interrupt Interrupt.
  *            @arg LPTIM_IT_CC1O    : Capture/Compare 1 over-capture Interrupt.
  *            @arg LPTIM_IT_CC2O    : Capture/Compare 2 over-capture Interrupt.
  *            @arg LPTIM_IT_CC3O    : Capture/Compare 3 over-capture Interrupt.
  *            @arg LPTIM_IT_CC4O    : Capture/Compare 4 over-capture Interrupt.
  * @retval None.
  * @note   The LPTIM interrupts can only be disabled when the LPTIM instance is enabled.
  */
#define __HAL_LPTIM_DISABLE_IT(__HANDLE__, __INTERRUPT__)   ((__HANDLE__)->Instance->DIER  &= (~(__INTERRUPT__)))

