stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_lptim.h
#define IS_LPTIM_PERIOD(__PERIOD__)             ((0x00000001UL <= (__PERIOD__)) &&\
                                                 ((__PERIOD__) <= 0x0000FFFFUL))

#define IS_LPTIM_PULSE(__PULSE__)               ((__PULSE__) <= 0x0000FFFFUL)

#define IS_LPTIM_OC_POLARITY(__OCPOLARITY__)    (((__OCPOLARITY__) == LPTIM_OCPOLARITY_LOW) || \
                                                 ((__OCPOLARITY__) == LPTIM_OCPOLARITY_HIGH))
#define IS_LPTIM_IC_PRESCALER(__PRESCALER__)    (((__PRESCALER__) == LPTIM_ICPSC_DIV1) ||\
                                                 ((__PRESCALER__) == LPTIM_ICPSC_DIV2) ||\
                                                 ((__PRESCALER__) == LPTIM_ICPSC_DIV4) ||\
                                                 ((__PRESCALER__) == LPTIM_ICPSC_DIV8))

#define IS_LPTIM_IC_POLARITY(__POLARITY__)      (((__POLARITY__) == LPTIM_ICPOLARITY_RISING) || \
                                                 ((__POLARITY__) == LPTIM_ICPOLARITY_FALLING) ||\
                                                 ((__POLARITY__) == LPTIM_ICPOLARITY_RISING_FALLING))

#define IS_LPTIM_IC_FILTER(__FILTER__)          (((__FILTER__) == LPTIM_ICFLT_CLOCK_DIV1) ||\
                                                 ((__FILTER__) == LPTIM_ICFLT_CLOCK_DIV2) ||\
                                                 ((__FILTER__) == LPTIM_ICFLT_CLOCK_DIV4) ||\
                                                 ((__FILTER__) == LPTIM_ICFLT_CLOCK_DIV8))

#define IS_LPTIM_REPETITION(__REPETITION__)     ((__REPETITION__) <= 0x000000FFUL)

#if defined(LPTIM3)
#define IS_LPTIM_INPUT1_SOURCE(__INSTANCE__, __SOURCE__)   \
  ((((__INSTANCE__) == LPTIM1) &&                          \
    (((__SOURCE__) == LPTIM_INPUT1SOURCE_GPIO) ||          \
     ((__SOURCE__) == LPTIM_INPUT1SOURCE_COMP1)))          \
   ||                                                      \
   (((__INSTANCE__) == LPTIM2) &&                          \
    (((__SOURCE__) == LPTIM_INPUT1SOURCE_GPIO)  ||         \
     ((__SOURCE__) == LPTIM_INPUT1SOURCE_COMP1) ||         \
     ((__SOURCE__) == LPTIM_INPUT1SOURCE_COMP2) ||         \
     ((__SOURCE__) == LPTIM_INPUT1SOURCE_COMP1_COMP2)))    \
   ||                                                      \
   (((__INSTANCE__) == LPTIM3) &&                          \
    (((__SOURCE__) == LPTIM_INPUT1SOURCE_GPIO)  ||         \
     ((__SOURCE__) == LPTIM_INPUT1SOURCE_COMP1))))
#else
#define IS_LPTIM_INPUT1_SOURCE(__INSTANCE__, __SOURCE__)   \
  ((((__INSTANCE__) == LPTIM1) &&                          \
    (((__SOURCE__) == LPTIM_INPUT1SOURCE_GPIO) ||          \
     ((__SOURCE__) == LPTIM_INPUT1SOURCE_COMP1)))          \
   ||                                                      \
   (((__INSTANCE__) == LPTIM2) &&                          \
    (((__SOURCE__) == LPTIM_INPUT1SOURCE_GPIO)  ||         \
     ((__SOURCE__) == LPTIM_INPUT1SOURCE_COMP1))))
#endif /* LPTIM3 */

#if defined(LPTIM3)
#define IS_LPTIM_INPUT2_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM1) ||                        \
    ((__INSTANCE__) == LPTIM3)) &&                       \
   (((__SOURCE__) == LPTIM_INPUT2SOURCE_GPIO) ||         \
    ((__SOURCE__) == LPTIM_INPUT2SOURCE_COMP2)))
#else
#define IS_LPTIM_INPUT2_SOURCE(__INSTANCE__, __SOURCE__) \
  (((__INSTANCE__) == LPTIM1) &&                         \
   ((__SOURCE__) == LPTIM_INPUT2SOURCE_GPIO))
#endif /* LPTIM3 */

#if defined(LPTIM3)
#define IS_LPTIM_IC1_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM1) ||                     \
    ((__INSTANCE__) == LPTIM2) ||                     \
    ((__INSTANCE__) == LPTIM3)) &&                    \
   (((__SOURCE__) == LPTIM_IC1SOURCE_GPIO) ||         \
    ((__SOURCE__) == LPTIM_IC1SOURCE_COMP1) ||        \
    ((__SOURCE__) == LPTIM_IC1SOURCE_COMP2)))

#define IS_LPTIM_IC2_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM1) ||                     \
    ((__INSTANCE__) == LPTIM2) ||                     \
    ((__INSTANCE__) == LPTIM3)) &&                    \
   (((__SOURCE__) == LPTIM_IC2SOURCE_GPIO) ||         \
    ((__SOURCE__) == LPTIM_IC2SOURCE_MCO1) ||         \
    ((__SOURCE__) == LPTIM_IC2SOURCE_MCO2)))

#define IS_LPTIM_IC3_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM1) ||                     \
    ((__INSTANCE__) == LPTIM3)) &&                    \
   (((__SOURCE__) == LPTIM_IC3SOURCE_GPIO) ||         \
    ((__SOURCE__) == LPTIM_IC3SOURCE_COMP1) ||        \
    ((__SOURCE__) == LPTIM_IC3SOURCE_COMP2)))

#define IS_LPTIM_IC4_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM1) ||                     \
    ((__INSTANCE__) == LPTIM3)) &&                    \
   (((__SOURCE__) == LPTIM_IC4SOURCE_GPIO) ||         \
    ((__SOURCE__) == LPTIM_IC4SOURCE_COMP1) ||        \
    ((__SOURCE__) == LPTIM_IC4SOURCE_COMP2)))
#else
#define IS_LPTIM_IC1_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM1) ||                     \
    ((__INSTANCE__) == LPTIM2)) &&                    \
   (((__SOURCE__) == LPTIM_IC1SOURCE_GPIO) ||         \
    ((__SOURCE__) == LPTIM_IC1SOURCE_COMP1)))

#define IS_LPTIM_IC2_SOURCE(__INSTANCE__, __SOURCE__) \
  ((((__INSTANCE__) == LPTIM1) ||                     \
    ((__INSTANCE__) == LPTIM2)) &&                    \
   (((__SOURCE__) == LPTIM_IC2SOURCE_GPIO) ||         \
    ((__SOURCE__) == LPTIM_IC2SOURCE_MCO1) ||         \
    ((__SOURCE__) == LPTIM_IC2SOURCE_MCO2)))

#define IS_LPTIM_IC3_SOURCE(__INSTANCE__, __SOURCE__) \
  (((__INSTANCE__) == LPTIM1) &&                      \
   (((__SOURCE__) == LPTIM_IC3SOURCE_GPIO) ||         \
    ((__SOURCE__) == LPTIM_IC3SOURCE_COMP1)))

#define IS_LPTIM_IC4_SOURCE(__INSTANCE__, __SOURCE__) \
  (((__INSTANCE__) == LPTIM1) &&                      \
   (((__SOURCE__) == LPTIM_IC4SOURCE_GPIO) ||         \
    ((__SOURCE__) == LPTIM_IC4SOURCE_COMP1)))
#endif /* LPTIM3 */

#define LPTIM_CHANNEL_STATE_GET(__INSTANCE__, __CHANNEL__)\
  (((__CHANNEL__) == LPTIM_CHANNEL_1) ? (__INSTANCE__)->ChannelState[0] :\
   ((__CHANNEL__) == LPTIM_CHANNEL_2) ? (__INSTANCE__)->ChannelState[1] :\
   ((__CHANNEL__) == LPTIM_CHANNEL_3) ? (__INSTANCE__)->ChannelState[2] :\
   (__INSTANCE__)->ChannelState[3])

#define LPTIM_CHANNEL_STATE_SET(__INSTANCE__, __CHANNEL__, __CHANNEL_STATE__) \
  (((__CHANNEL__) == LPTIM_CHANNEL_1) ? ((__INSTANCE__)->ChannelState[0] = (__CHANNEL_STATE__)) :\
   ((__CHANNEL__) == LPTIM_CHANNEL_2) ? ((__INSTANCE__)->ChannelState[1] = (__CHANNEL_STATE__)) :\
   ((__CHANNEL__) == LPTIM_CHANNEL_3) ? ((__INSTANCE__)->ChannelState[2] = (__CHANNEL_STATE__))  :\
   ((__INSTANCE__)->ChannelState[3] = (__CHANNEL_STATE__)))

#define LPTIM_CHANNEL_STATE_SET_ALL(__INSTANCE__,  __CHANNEL_STATE__) do { \
                                                                           (__INSTANCE__)->ChannelState[0]  = (__CHANNEL_STATE__);  \
                                                                           (__INSTANCE__)->ChannelState[1]  = (__CHANNEL_STATE__);  \
                                                                           (__INSTANCE__)->ChannelState[2]  = (__CHANNEL_STATE__);  \
                                                                           (__INSTANCE__)->ChannelState[3]  = (__CHANNEL_STATE__);  \
                                                                         } while(0)

#if defined(LPTIM3)
#define IS_LPTIM_CCX_INSTANCE(__INSTANCE__, __CHANNEL__) \
  ((((__INSTANCE__) == LPTIM1)  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_3) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_4)))   \
   ||                                        \
   (((__INSTANCE__) == LPTIM2)  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2)))   \
   ||                                        \
   (((__INSTANCE__) == LPTIM3)  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_3) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_4))))
#else
#define IS_LPTIM_CCX_INSTANCE(__INSTANCE__, __CHANNEL__) \
  ((((__INSTANCE__) == LPTIM1)  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_3) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_4)))   \
   ||                                        \
   (((__INSTANCE__) == LPTIM2)  && \
    (((__CHANNEL__)  == LPTIM_CHANNEL_1) ||  \
     ((__CHANNEL__)  == LPTIM_CHANNEL_2))))
#endif /* LPTIM3 */
/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup LPTIM_Private_Functions LPTIM Private Functions
  * @{
  */
/**
  * @}
  */

/**
  * @}
  */

#endif /* LPTIM1 || LPTIM2 ||  LPTIM3 */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32U0xx_HAL_LPTIM_H */
